function (_0x46ac6f, _0x64a456) {
    const _0x1045b6 = _0x46ac6f();
    while (!![]) {
        try {
            const _0x2aed09 = -parseInt(_0x455e(0x66)) / 0x1 + parseInt(_0x455e(0x5f)) / 0x2 + parseInt(_0x455e(0x69)) / 0x3 * (-parseInt(_0x455e(0x4)) / 0x4) + parseInt(_0x455e(0x5e)) / 0x5 * (-parseInt(_0x455e(0x6)) / 0x6) + parseInt(_0x455e(0x20)) / 0x7 * (-parseInt(_0x455e(0x53)) / 0x8) + parseInt(_0x455e(0x23)) / 0x9 + parseInt(_0x455e(0x6e)) / 0xa;
            if (_0x2aed09 === _0x64a456) {
                break;
            } else {
                _0x1045b6['push'](_0x1045b6['shift']());
            }
        } catch (_0x11cf30) {
            _0x1045b6['push'](_0x1045b6['shift']());
        }
    }
}(_0x3dfd, 0xdc141));
const _0x2ae015 = (function () {
    let _0x3dc2ee = !![];
    return function (_0x290776, _0xfa3aa5) {
        const _0xe3b9a = _0x3dc2ee ? function () {
            if (_0xfa3aa5) {
                const _0x21d5c1 = _0xfa3aa5['apply'](_0x290776, arguments);
                _0xfa3aa5 = null;
                return _0x21d5c1;
            }
        } : function () {};
        _0x3dc2ee = ![];
        return _0xe3b9a;
    };
}());
const _0x2f9e47 = _0x2ae015(this, function () {
    const _0x28febb = function () {
        let _0x51eedf;
        try {
            _0x51eedf = Function(_0x455e(0x37) + '{}.constructor(\"return this\")( )' + ');')();
        } catch (_0xf899ff) {
            _0x51eedf = window;
        }
        return _0x51eedf;
    };
    const _0x5b008f = _0x28febb();
    const _0x4d74aa = _0x5b008f[_0x455e(0x1d)] = _0x5b008f[_0x455e(0x1d)] || {};
    const _0x32fdd3 = ['log', _0x455e(0x3e), _0x455e(0x9), _0x455e(0x2d), _0x455e(0x39), 'table', _0x455e(0x68)];
    for (let _0x1df3f0 = 0x0; _0x1df3f0 < _0x32fdd3[_0x455e(0x33)]; _0x1df3f0++) {
        const _0x1c1965 = _0x2ae015['constructor'][_0x455e(0x4a)][_0x455e(0x3)](_0x2ae015);
        const _0x340806 = _0x32fdd3[_0x1df3f0];
        const _0x3633dc = _0x4d74aa[_0x340806] || _0x1c1965;
        _0x1c1965[_0x455e(0x32)] = _0x2ae015[_0x455e(0x3)](_0x2ae015);
        _0x1c1965[_0x455e(0x17)] = _0x3633dc['toString'][_0x455e(0x3)](_0x3633dc);
        _0x4d74aa[_0x340806] = _0x1c1965;
    }
});

function _0x455e(_0x59762a, _0x186bab) {
    const _0x2f9e47 = _0x3dfd();
    _0x455e = function (_0x2ae015, _0x5c0c62) {
        _0x2ae015 = _0x2ae015 - 0x0;
        let _0x3dfdf3 = _0x2f9e47[_0x2ae015];
        return _0x3dfdf3;
    };
    return _0x455e(_0x59762a, _0x186bab);
}
_0x2f9e47();
const handler = async (_0x5f1983, {
    conn: _0x4a693a,
    usedPrefix: _0x345c8f,
    command: _0x175620,
    args: _0xf5f215,
    isOwner: _0x54c363,
    isAdmin: _0x266e2b,
    isROwner: _0x4a4267
}) => {
    const _0x37decf = (global['veeeee'] + _0x455e(0x4d) + (_0x345c8f + _0x175620) + _0x455e(0x26) + (_0x345c8f + _0x175620) + _0x455e(0x51) + (_0x345c8f + _0x175620) + _0x455e(0x4f) + (_0x345c8f + _0x175620) + _0x455e(0x2) + (_0x345c8f + _0x175620) + _0x455e(0x57) + (_0x345c8f + _0x175620) + _0x455e(0x42) + (_0x345c8f + _0x175620) + ' تقيد\x0a*وصف:* فتح او قفل قيود البوت مثلا  يطرد و يضيفه.\x0a*حاله:* المطور بس الي يستعمل الامر ده.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* ☑️ | القرائه التلقائي\x0a*الامر:* ' + (_0x345c8f + _0x175620) + _0x455e(0x3b) + (_0x345c8f + _0x175620) + _0x455e(0x6a) + (_0x345c8f + _0x175620) + _0x455e(0x62) + (_0x345c8f + _0x175620) + _0x455e(0x29) + (_0x345c8f + _0x175620) + ' جروبات\x0a*الوصف:* البوت هيشتغل في الجروبات بس. \x0a*الحاله:* المطور بس الي يستخدم الامر ده.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* ❌ | مضاد الاخفاء\x0a*الامر:* ' + (_0x345c8f + _0x175620) + _0x455e(0x46) + (_0x345c8f + _0x175620) + _0x455e(0x2c) + (_0x345c8f + _0x175620) + _0x455e(0x3c) + (_0x345c8f + _0x175620) + _0x455e(0x61) + (_0x345c8f + _0x175620) + _0x455e(0x41) + _0x345c8f + _0x455e(0x1f) + _0x345c8f + _0x455e(0x3a) + (_0x345c8f + _0x175620) + _0x455e(0x13) + (_0x345c8f + _0x175620) + _0x455e(0x7) + (_0x345c8f + _0x175620) + _0x455e(0x54) + (_0x345c8f + _0x175620) + _0x455e(0x15) + (_0x345c8f + _0x175620) + _0x455e(0x1c))[_0x455e(0x6d)]();
    const _0x1af449 = /true|افتح|enable|(turn)?on|1/i [_0x455e(0x4e)](_0x175620);
    const _0x155ab2 = global['db']['data'][_0x455e(0x2a)][_0x5f1983[_0x455e(0x45)]];
    const _0x17404f = global['db'][_0x455e(0x3d)]['settings'][_0x4a693a[_0x455e(0x4c)]['jid']] || {};
    const _0x142fee = (_0xf5f215[0x0] || '')[_0x455e(0xb)]();
    let _0x1cee6f = ![];
    switch (_0x142fee) {
    case _0x455e(0x55):
        if (!_0x5f1983[_0x455e(0x0)]) {
            if (!_0x54c363) {
                global[_0x455e(0x50)]('group', _0x5f1983, _0x4a693a);
                throw ![];
            }
        } else if (!(_0x266e2b || _0x54c363 || _0x4a4267)) {
            global['dfail'](_0x455e(0x2b), _0x5f1983, _0x4a693a);
            throw ![];
        }
        _0x155ab2[_0x455e(0x12)] = _0x1af449;
        break;
    case _0x455e(0x2e):
        if (!_0x5f1983[_0x455e(0x0)]) {
            if (!_0x54c363) {
                global['dfail']('group', _0x5f1983, _0x4a693a);
                throw ![];
            }
        } else if (!_0x266e2b) {
            global['dfail']('admin', _0x5f1983, _0x4a693a);
            throw ![];
        }
        _0x155ab2[_0x455e(0x1b)] = _0x1af449;
        break;
    case _0x455e(0x5a):
        if (!_0x5f1983[_0x455e(0x0)]) {
            if (!_0x54c363) {
                global[_0x455e(0x50)]('group', _0x5f1983, _0x4a693a);
                throw ![];
            }
        } else if (!_0x266e2b) {
            global['dfail']('admin', _0x5f1983, _0x4a693a);
            throw ![];
        }
        _0x155ab2[_0x455e(0x24)] = _0x1af449;
        break;
    case 'سمسمي':
        if (_0x5f1983[_0x455e(0x0)]) {
            if (!(_0x266e2b || _0x54c363)) {
                global['dfail'](_0x455e(0x2b), _0x5f1983, _0x4a693a);
                throw ![];
            }
        }
        _0x155ab2[_0x455e(0x6b)] = _0x1af449;
        break;
    case 'antiporno':
        if (_0x5f1983[_0x455e(0x0)]) {
            if (!(_0x266e2b || _0x54c363)) {
                global['dfail'](_0x455e(0x2b), _0x5f1983, _0x4a693a);
                throw ![];
            }
        }
        _0x155ab2['antiporno'] = _0x1af449;
        break;
    case _0x455e(0x11):
        if (_0x5f1983[_0x455e(0x0)]) {
            if (!(_0x266e2b || _0x54c363)) {
                global[_0x455e(0x50)](_0x455e(0x2b), _0x5f1983, _0x4a693a);
                throw ![];
            }
        }
        _0x155ab2[_0x455e(0x11)] = _0x1af449;
        break;
    case _0x455e(0x6f):
        if (_0x5f1983[_0x455e(0x0)]) {
            if (!(_0x266e2b || _0x54c363)) {
                global[_0x455e(0x50)](_0x455e(0x2b), _0x5f1983, _0x4a693a);
                throw ![];
            }
        }
        _0x155ab2['antidelete'] = _0x1af449;
        break;
    case _0x455e(0x35):
        _0x1cee6f = !![];
        if (!_0x4a4267) {
            global[_0x455e(0x50)](_0x455e(0x43), _0x5f1983, _0x4a693a);
            throw ![];
        }
        global[_0x455e(0x48)][_0x455e(0x59)] = !_0x1af449;
        break;
    case _0x455e(0xf):
        if (_0x5f1983[_0x455e(0x0)]) {
            if (!(_0x266e2b || _0x54c363)) {
                global['dfail'](_0x455e(0x2b), _0x5f1983, _0x4a693a);
                throw ![];
            }
        }
        _0x155ab2[_0x455e(0x5c)] = _0x1af449;
        break;
    case _0x455e(0x5b):
        if (_0x5f1983['isGroup']) {
            if (!(_0x266e2b || _0x54c363)) {
                global[_0x455e(0x50)](_0x455e(0x2b), _0x5f1983, _0x4a693a);
                throw ![];
            }
        }
        _0x155ab2[_0x455e(0x14)] = _0x1af449;
        break;
    case _0x455e(0x22):
        if (_0x5f1983[_0x455e(0x0)]) {
            if (!(_0x266e2b || _0x54c363)) {
                global[_0x455e(0x50)]('admin', _0x5f1983, _0x4a693a);
                throw ![];
            }
        }
        _0x155ab2[_0x455e(0x6c)] = _0x1af449;
        break;
    case _0x455e(0x38):
        if (_0x5f1983[_0x455e(0x0)]) {
            if (!(_0x266e2b || _0x54c363)) {
                global['dfail']('admin', _0x5f1983, _0x4a693a);
                throw ![];
            }
        }
        _0x155ab2[_0x455e(0x38)] = _0x1af449;
        break;
    case _0x455e(0x5):
        if (_0x5f1983[_0x455e(0x0)]) {
            if (!(_0x266e2b || _0x54c363)) {
                global['dfail']('admin', _0x5f1983, _0x4a693a);
                throw ![];
            }
        }
        _0x155ab2[_0x455e(0x25)] = _0x1af449;
        break;
    case _0x455e(0x65):
        if (_0x5f1983[_0x455e(0x0)]) {
            if (!(_0x266e2b || _0x54c363)) {
                global[_0x455e(0x50)]('admin', _0x5f1983, _0x4a693a);
                throw ![];
            }
        }
        _0x155ab2['autosticker'] = _0x1af449;
        break;
    case _0x455e(0x27):
        if (_0x5f1983[_0x455e(0x0)]) {
            if (!(_0x266e2b || _0x54c363)) {
                global[_0x455e(0x50)]('admin', _0x5f1983, _0x4a693a);
                throw ![];
            }
        }
        _0x155ab2[_0x455e(0x49)] = _0x1af449;
        break;
    case _0x455e(0x1e):
        _0x1cee6f = !![];
        if (!_0x54c363) {
            global[_0x455e(0x50)]('owner', _0x5f1983, _0x4a693a);
            throw ![];
        }
        _0x17404f[_0x455e(0x30)] = _0x1af449;
        break;
    case _0x455e(0x52):
        _0x1cee6f = !![];
        if (!_0x54c363) {
            global[_0x455e(0x50)](_0x455e(0x34), _0x5f1983, _0x4a693a);
            throw ![];
        }
        _0x17404f[_0x455e(0x19)] = _0x1af449;
        break;
    case 'nyimak':
        _0x1cee6f = !![];
        if (!_0x4a4267) {
            global[_0x455e(0x50)]('rowner', _0x5f1983, _0x4a693a);
            throw ![];
        }
        global['opts'][_0x455e(0x28)] = _0x1af449;
        break;
    case _0x455e(0x1):
        _0x1cee6f = !![];
        if (!_0x4a4267) {
            global[_0x455e(0x50)](_0x455e(0x43), _0x5f1983, _0x4a693a);
            throw ![];
        }
        _0x17404f['autoread2'] = _0x1af449;
        global[_0x455e(0x48)]['autoread'] = _0x1af449;
        break;
    case _0x455e(0x40):
    case 'privateonly':
        _0x1cee6f = !![];
        if (!_0x4a4267) {
            global[_0x455e(0x50)]('rowner', _0x5f1983, _0x4a693a);
            throw ![];
        }
        global[_0x455e(0x48)][_0x455e(0x56)] = _0x1af449;
        break;
    case _0x455e(0x64):
    case 'grouponly':
        _0x1cee6f = !![];
        if (!_0x4a4267) {
            global[_0x455e(0x50)](_0x455e(0x43), _0x5f1983, _0x4a693a);
            throw ![];
        }
        global['opts'][_0x455e(0x16)] = _0x1af449;
        break;
    case _0x455e(0x4b):
    case _0x455e(0x31):
        _0x1cee6f = !![];
        if (!_0x4a4267) {
            global[_0x455e(0x50)](_0x455e(0x43), _0x5f1983, _0x4a693a);
            throw ![];
        }
        global[_0x455e(0x48)]['swonly'] = _0x1af449;
        break;
    case _0x455e(0x67):
        _0x1cee6f = !![];
        if (!_0x4a4267) {
            global[_0x455e(0x50)]('rowner', _0x5f1983, _0x4a693a);
            throw ![];
        }
        _0x17404f[_0x455e(0x1a)] = _0x1af449;
        break;
    case _0x455e(0xd):
        _0x1cee6f = !![];
        if (!_0x4a4267) {
            global[_0x455e(0x50)](_0x455e(0x43), _0x5f1983, _0x4a693a);
            throw ![];
        }
        _0x17404f[_0x455e(0xc)] = _0x1af449;
        break;
    case _0x455e(0xa):
        _0x1cee6f = !![];
        if (!_0x4a4267) {
            global[_0x455e(0x50)](_0x455e(0x43), _0x5f1983, _0x4a693a);
            throw ![];
        }
        _0x17404f[_0x455e(0x36)] = _0x1af449;
        break;
    case 'مضادالاسبام':
        _0x1cee6f = !![];
        if (!_0x4a4267) {
            global[_0x455e(0x50)](_0x455e(0x43), _0x5f1983, _0x4a693a);
            throw ![];
        }
        _0x17404f['antispam'] = _0x1af449;
        break;
    case _0x455e(0x8):
        if (_0x5f1983[_0x455e(0x0)]) {
            if (!(_0x266e2b || _0x54c363)) {
                global[_0x455e(0x50)](_0x455e(0x2b), _0x5f1983, _0x4a693a);
                throw ![];
            }
        }
        _0x155ab2['antiToxic'] = _0x1af449;
        break;
    case 'antitraba':
        if (_0x5f1983[_0x455e(0x0)]) {
            if (!(_0x266e2b || _0x54c363)) {
                global[_0x455e(0x50)]('admin', _0x5f1983, _0x4a693a);
                throw ![];
            }
        }
        _0x155ab2[_0x455e(0x18)] = _0x1af449;
        break;
    case _0x455e(0x2f):
        if (_0x5f1983[_0x455e(0x0)]) {
            if (!(_0x266e2b || _0x54c363)) {
                global[_0x455e(0x50)](_0x455e(0x2b), _0x5f1983, _0x4a693a);
                throw ![];
            }
        }
        _0x155ab2['antiArab'] = _0x1af449;
        break;
    case 'antiarabes2':
        if (_0x5f1983['isGroup']) {
            if (!(_0x266e2b || _0x54c363)) {
                global[_0x455e(0x50)]('admin', _0x5f1983, _0x4a693a);
                throw ![];
            }
        }
        _0x155ab2['antiArab2'] = _0x1af449;
        break;
    default:
        if (!/[01]/ [_0x455e(0x4e)](_0x175620)) {
            return await _0x4a693a[_0x455e(0x60)](_0x5f1983[_0x455e(0x45)], {
                'text': _0x37decf
            }, {
                'quoted': _0x5f1983
            });
        }
        throw ![];
    }
    _0x4a693a[_0x455e(0x60)](_0x5f1983[_0x455e(0x45)], {
        'text': _0x455e(0x70) + _0x142fee + _0x455e(0x3f) + (_0x1af449 ? _0x455e(0x47) : 'قافل') + '\x0a📣 اين: ' + (_0x1cee6f ? _0x455e(0x44) : 'هذا الدردشه')
    }, {
        'quoted': _0x5f1983
    });
};
handler[_0x455e(0x63)] = ['en', _0x455e(0x5d)][_0x455e(0x10)](_0x5b22ba => _0x5b22ba + _0x455e(0xe));
handler['tags'] = [_0x455e(0x58), _0x455e(0x34)];
handler[_0x455e(0x21)] = /^((en|dis)able|(onn|off)|(turn)?[01])$/i;
export default handler;

function _0x3dfd() {
    const _0x53420a = ['\x0a🎚️ الوضع: ', 'برايفت', ' البوت-الفرعي\x0a*الحاله:* تفعيل و اقاف امر (', ' كشف2\x0a*الوصف:* يكشف التعديلات في المجموعه و يحافظ علي اداره افضل.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* ❗ | يقيد\x0a*الامر:* ', 'rowner', 'هذا البوت', 'chat', ' مضادالاخفاء\x0a*الوصف:* الصوره او الفيديو الذي يبعت ليرا مره واحده يبعت من البوت مره اخري بشكل طبيعي. \x0a\x0a--------------------------------\x0a\x0a*الخيار:* 📵 | ممنوع الاتصال\x0a*الامر:* ', 'شغال', 'opts', 'audios', 'prototype', 'swonly', 'user', '\x0a°°°°°°°°°°°°°°°°°°°°°°°°°°°°°\x0a*الخيار:* ✨ | الترحيب\x0a*الامر:* ', 'test', ' مضاداللينكات\x0a*الحاله:* تشغيل او ايقاف مضاد لينكات الواتس.\x0a*الحاله:* يجب ان يكون مفعلا.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🔗 | مضاد اللنكات 2\x0a*الامر:* ', 'dfail', ' عام\x0a*الوصف:* يصبح البوت علنا او خاصا.\x0a*الحاله:* لا يمكن استخدام هذا الامر الا بواسطه المطور.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🔗 | مضاد اللينكات\x0a*الامر:* ', 'اصوات_البوت', '29392xMyvXx', ' مضادالاسبام\x0a*الوصف:* يكتشف البوت بعد ارسال 5 رسائل و يحظر المستخدم.\x0a*الخاله:* المطور بس الي يستخدم الامر ده.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🛡️ | مضاد الحذف\x0a*الامر:* ', 'الترحيب', 'pconly', ' كشف\x0a*:* تنشيط او الغاء التعديل علي الوصف.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🔎 | كشف 2\x0a*الامر:* ', 'group', 'self', 'كشف2', 'مضاداللينكات2', 'antiLink', 'dis', '327115oRwUGD', '2176262mCPTcz', 'sendMessage', ' مضادالشتائم\x0a*الوصف:* يقوم بتحذير اي شخص سب او شتم او كتب شئ عيب واذا تجاوذ التحذيرات يقوم بطرده.\x0a*الحاله:* يجب ان يكون التقيد مفعلا.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🤖 | البوت الفرعي\x0a*الامر:* ', ' ستيكرتلقائي \x0a*الوصف:*تصبح جميع الصور أو مقاطع الفيديو المرسلة في المجموعة ملصقات. \x0a\x0a--------------------------------\x0a\x0a*الخيار:* 💬 | خاص فقط\x0a*الامر:* ', 'help', 'جروبات', 'ستيكرتلقائي', '1283608keNOdj', 'مضادالمكالمات', 'trace', '7239zMqbDB', ' اصوات\x0a*الوصف:* فتح او قفل الريكات في الجروب.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 👾 | ستيكر تلقائي\x0a*الامر:* ', 'simi', 'antiviewonce', 'trim', '14719780oewUcW', 'مضادالحذف', '🗂️ الخيار: ', 'isGroup', 'الصحين', ' مضاداللينكات2\x0a*الوصف:* تشغيل وا اقاف مضاد اي لنكات.\x0a*الحاله:* يجب ان يكون مفعلا.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🔎 | كشف\x0a*الامر:* ', 'bind', '1244gbndFn', 'الادمن-فقط', '24nIQBbD', ' سمسمي\x0a*الوصف:* هيبدا البوت يرد باستخدام الذكاء الصتناعي سمسمي.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* ⏳ | مضاد الاسبام\x0a*الامر:* ', 'مضادالشتائم', 'info', 'البوت-الفرعي', 'toLowerCase', 'antiPrivate', 'مضادالخاص', 'able <option>', 'مضادالينكات', 'map', 'delete', 'welcome', ' الادمن-فقط\x0a*الوصف:* سوف يجيب البوت علي الادمن فقط.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 😃 | سمسمي\x0a*الامر:* ', 'antiLink2', ' مضادالحذف\x0a*الوصف:* يكتشف البوت الرساله المحذوفه و يقوم بتحويلها للمستخدم.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🔊 | صوت_بوت\x0a*الامر:* ', 'gconly', 'toString', 'antiTraba', 'audios_bot', 'antiCall', 'detect', ' اصوات_البوت\x0a*الوصف:* يتم الغاء جميعرالصوات الخاصه بالبوت .\x0a*الحاله:* المطور بس الي يستخدم الامر ده.', 'console', 'تقيد', 'serbot / ', '504BYsLPH', 'command', 'مضادالاخفاء', '8114427uCIMnC', 'detect2', 'modoadmin', ' الترحيب\x0a*الوصف:* فتح او قفل الترحيب في الجروب.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🌎 | مود العام\x0a*الامر:* ', 'اصوات', 'nyimak', ' برايفت\x0a*الوصف:* سوف يستجيب البوت في الخاص بس.\x0a*الحاله:* المطور بس الي يقدر يستعمل الامر ده.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🏢 | جروبات فقط\x0a*الامر:* ', 'chats', 'admin', ' مضادالاتصال\x0a*الوصف:* يبلك اي حد يرن علي رقم البوت. \x0a*الحاله:* المطور بس الي يستخدم الامر ده.\x0a\x0a--------------------------------\x0a\x0a*الخاله:* 💬 | مضاد الخاص\x0a*الامر:* ', 'error', 'كشف', 'antiarabes', 'restrict', 'statusonly', '__proto__', 'length', 'owner', 'عام', 'modejadibot', 'return (function() ', 'modohorny', 'exception', 'jadibot). \x0a*الحاله:* المطور بس الي يقدر يستعمل الامر ده.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 👑 | الادمن\x0a*الامر:* ', ' الصحين\x0a*الوصف:* فتح او قفل القرائه التلقائي.\x0a*الحاله:* المطور بس الي بيتسعمل الامر ده.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🔊 |  اصوات\x0a*الامر:* ', ' مضادالخاص\x0a*الوصف:* يبلك اي حد يكلم البوت خاص. \x0a*الحاله:* المطور بس الي يستخدم الامرد ده.\x0a\x0a--------------------------------\x0a\x0a*الخيار:* 🤬 | مضاد الشتائم\x0a*الامر:* ', 'data', 'warn'];
    _0x3dfd = function () {
        return _0x53420a;
    };
    return _0x3dfd();
}